trade_exp/src/DataProcessors/РабочееМестоКладовщикаАльтерра/РабочееМестоКладовщикаАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКладовщикаАльтерра</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DefinedType.РаспоряжениеНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоУпаковочныйЛист</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DefinedType.РаспоряжениеНаПоступление</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЭлектроннаяОчередьКлиентов/ЭлектроннаяОчередьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d8c9c294-870a-44ea-8c5a-f42a13a7459f">
  <name>ЭлектроннаяОчередьКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7bf41d18-a27a-4fba-80a3-8f6785279797">
    <name>ЧастичноОтгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b0a91b44-0e01-4076-bc0a-e247692c423d">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e7944fb5-14d5-41da-8470-3a465f450b0b">
    <name>ОтметкаКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="99ad658e-788e-4122-b16a-fcaa62283677">
    <name>ТребуетсяОповещениеКладовщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0e22a688-0adf-48bf-b768-8d362798bfa0">
    <name>ПолучательУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="801d9ec6-cb3c-4867-98c2-4afaa72c9673">
    <name>СтатусОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5dccbe81-f872-46d5-a8a5-30af95c1f5d6">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d26f016a-39dd-4378-824e-bb04999f6b10">
    <name>ССайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5888bede-9c96-4076-b99f-977e4a559fc0">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f75ffc24-34ae-4ec8-92d2-90c5ccaaa229">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="16ef9874-783e-49a8-bbc6-59fbe7b17586">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f3371cf8-1d4f-43fc-a7ad-e3e827a6f002">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыПриходныхОрдеров/СтатусыПриходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="58ab352b-2fda-4618-8f5e-14d83c1300f2">
  <name>СтатусыПриходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="51091c69-7e1a-4e28-8412-c3a970faaf1d">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fcb9b0b5-3360-47e9-bb41-297eaf6890d9">
    <name>ТребуетсяОбработка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЭлектроннойОчереди/СтатусыЭлектроннойОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50ebb253-dfc9-40d8-b492-fcbfb669bc01">
  <name>СтатусыЭлектроннойОчереди</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b235c12d-541e-4263-bf1d-e5521ad06455">
    <name>ОжидаетсяОтбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="83736d22-9656-4e5f-97c8-dcdcdec7ef61">
    <name>Набирается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c45f0107-54a2-4b21-ae97-e14dca629ad9">
    <name>Набран</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a5091316-357f-4d00-9ffb-5683c9bac672">
    <name>Выдан</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/РабочиеУчастки/РабочиеУчастки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7c863b06-6e02-4c69-add5-1e7cdc4b412d">
  <name>РабочиеУчастки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Порядок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОграничиватьПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничениеПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПорядокОбработкиСкладскогоЗадания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничениеПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничиватьПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПреднаборке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВыдачаВОкно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПриемкеСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяВОтгрузкеСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаСкладскихЯчеекХраненияПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d60f4b7b-33b6-404d-a00a-86bdd9eddd85">
    <name>ИнтервалОповещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0d146d97-4688-44d2-86c1-47fc265eda01">
    <name>СкрытьКоличествоПоУчету</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24236bcd-ee24-4288-b790-a71e6ec62dae">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45e29f47-2a23-4196-a70d-24909d3aaaae">
    <name>ЭлектроннаяОчередь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/РабочееМестоКладовщикаАльтерра/Forms/ФормаПриемПоРейсу/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	ВремяСохраненияДокументов=Константы.ВремяСохраненияДокументов.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);                                           
	
	Если Параметры.Свойство("Сотрудник") Тогда
	   ТекущийИсполнительПриемТовара = Параметры.Сотрудник;
	   Сотрудник = Параметры.Сотрудник;
	   Склад = ТекущийИсполнительПриемТовара.Склад;
	   СекцииСотрудника.ЗагрузитьЗначения(ТекущийИсполнительПриемТовара.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток"));
	КонецЕсли;                       

	Если Параметры.Свойство("СписокОрдеров") тогда
		СписокОрдеров.ЗагрузитьЗначения(Параметры.СписокОрдеров);
		Если ЗначениеЗаполнено(СписокОрдеров) Тогда
			ПервыйОрдер = СписокОрдеров[0].Значение;
			ПервыйОрдерРаспоряжение = ПервыйОрдер.Распоряжение;
			ПервыйОрдерРабочийУчасток = ПервыйОрдер.РабочийУчасток;
			ЗаполнитьТовары();
		КонецЕсли;
	КонецЕсли;            
	
	Статус = Перечисления.СтатусыПриходныхОрдеров.КПоступлению;
	
	ДоступныеЯчейки.Параметры.УстановитьЗначениеПараметра("Ссылка",Склад);

	ЗаполнитьПлановоеКоличество();
	
	ЗаполнитьТоварыЯчейка(); 
	
	//Подключение оповещений из очереди
	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = Сотрудник.ОповещенияИзОчереди; 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;    
	СекцииСотрудника = СекцииСотрудника();
	Для каждого Стр Из СекцииСотрудника Цикл
		ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
		Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
			Инт = ЗнчИнтервала;
		КонецЕсли; 
	КонецЦикла; 
	ИнтервалОповещений = Инт;

		
КонецПроцедуры       

Процедура ЗаполнитьТовары()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТоварыТовары.Ссылка КАК Ссылка,
		|	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
		|	ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
		|	ПриходныйОрдерНаТоварыТовары.Назначение КАК Назначение,
		|	ПриходныйОрдерНаТоварыТовары.Упаковка КАК Упаковка,
		|	ПриходныйОрдерНаТоварыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
		|	ПриходныйОрдерНаТоварыТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ПриходныйОрдерНаТоварыТовары.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ПриходныйОрдерНаТоварыТовары.УпаковочныйЛист КАК УпаковочныйЛист,
		|	ПриходныйОрдерНаТоварыТовары.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
		|	ПриходныйОрдерНаТоварыТовары.Штрихкод КАК Штрихкод,
		|	ПриходныйОрдерНаТоварыТовары.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
		|	ПриходныйОрдерНаТоварыТовары.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
		|	ПриходныйОрдерНаТоварыТовары.Комментарий КАК Комментарий,
		|	ПриходныйОрдерНаТоварыТовары.Серия КАК Серия,
		|	ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение КАК Распоряжение
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
		|ГДЕ
		|	ПриходныйОрдерНаТоварыТовары.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СписокОрдеров.ВыгрузитьЗначения());
	
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());  
	
КонецПроцедуры 
			
Процедура ЗаполнитьНомераДокументов()
	НомераДокументов = "";
	
	Для Каждого Ордер Из СписокОрдеров Цикл   
		Номер_ = Ордер.Значение.Номер;
		Если ЗначениеЗаполнено(НомераДокументов) Тогда
			НомераДокументов = НомераДокументов + ", " + Номер_;
		Иначе
			НомераДокументов = Номер_; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры        

&НаКлиенте
Процедура СообщитьОбИзмененииСтатуса()  
	Если ЗначениеЗаполнено(Статус) И ЗначениеЗаполнено(НомераДокументов) Тогда
		Сообщить("Документы:" + Символы.ПС + НомераДокументов + Символы.ПС + "переведены в статус '" + Статус + "'");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	

	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	ИнициализироватьСканер();
	
	ЗаполнитьПлановоеКоличествоВТаблице();

	ОтображатьХарактеристики = Ложь;

	УстановитьВидимостьХарактеристик();
	
	Если ВремяСохраненияДокументов > 0 Тогда
		ПодключитьОбработчикОжидания("ОбработатьОжидание", ВремяСохраненияДокументов, Ложь);
	КонецЕсли;
	
	Если ОповещенияИзОчереди Тогда
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 =  Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;

			Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.НовыйШтрихкод Тогда
				НовыйШтрихкод = "";
				Если ТипЗнч(Параметр) = Тип("Строка") Тогда
				НовыйШтрихкод = Параметр;
				КонецЕсли;
			Иначе
			    ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Штрихкод1));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
	ОтключитьСканер();
	
    Если НЕ ЗавершениеРаботы Тогда
        СообщитьОбИзмененииСтатуса();
	КонецЕсли;
	
	Если ВремяСохраненияДокументов > 0 Тогда
		ОтключитьОбработчикОжидания("ОбработатьОжидание");
	КонецЕсли;
 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицы

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)

	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;
		ТекущиеДанныеТСД = Элементы.Товары.ТекущиеДанные;
		
		Если типзнч(ТекущаяСтрокаТСД) <> Тип("Неопределено") Тогда
			
			ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
						
			Номенклатура = "";
			Характеристика = "";
			ПоУчету = 0;
		    Количество = 0;
			Комментарий = "";
		    Ячейка = "";
			НоваяЯчейка = "";
			НовыйШтрихкод = "";
			ТекущийОрдер = "";
			Распоряжение = "";
						
			Если ЭлементСписка <> Неопределено Тогда
				Элементы._РедактированиеДокументаНаТСД.Видимость=Ложь;
				Элементы._РедактированиеСтрокиНаТСД.Видимость=Истина;
				ТекущийОрдер = ЭлементСписка.Ссылка;
			    Распоряжение = ЭлементСписка.Распоряжение;
				Номенклатура = ЭлементСписка.Номенклатура;
				Характеристика = ЭлементСписка.Характеристика;
				Количество = ЭлементСписка.КоличествоУпаковок;
				ПоУчету = ЭлементСписка.КоличествоПлан;
				Комментарий = ЭлементСписка.Комментарий;
				ПолучитьЯчейку(Номенклатура, Склад);
			Конецесли;
	 
		Иначе
				Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
				КонецЕсли;
			Сообщить("Штрихкод не найден!");
		КонецЕсли;
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Отказ = Истина;
		
		Элементы._РедактированиеДокументаНаТСД.Видимость = Ложь;
		Элементы._ВыборНоменклатуры.Видимость = Истина;
    #КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрокаТСД = Элементы.Товары.ТекущаяСтрока;
	ТоварыВыбор_Обработка(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор_Обработка(ВызовИзОбработчика)
	Если типзнч(ТекущаяСтрокаТСД) <> Тип("Неопределено") Тогда

		ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
				
		Номенклатура = "";
		Характеристика = "";
		Количество = 0;
		ПоУчету = 0;
		Комментарий = "";
		Ячейка = "";
		НоваяЯчейка = "";
		НовыйШтрихкод = "";
		ТекущийОрдер = "";
		Распоряжение = "";
		АдресКартинки="";

		Если ЭлементСписка <> Неопределено Тогда
			Если ВызовИзОбработчика Тогда
				Элементы._РедактированиеДокументаНаТСД.Видимость=Ложь; 
			Иначе   
				Элементы._ВыборНоменклатуры.Видимость = Ложь;
			Конецесли; 
			
			Элементы._РедактированиеСтрокиНаТСД.Видимость = Истина;
			
			ТекущийОрдер = ЭлементСписка.Ссылка;
			Распоряжение = ЭлементСписка.Распоряжение;
			Номенклатура = ЭлементСписка.Номенклатура;
			Характеристика = ЭлементСписка.Характеристика;
			Количество = ЭлементСписка.КоличествоУпаковок;
			ПоУчету = ЭлементСписка.КоличествоПлан;
			Комментарий = ЭлементСписка.Комментарий;
			ПолучитьЯчейку(Номенклатура, Склад);
			ПолучитьАдресКартинки(Номенклатура);
		Конецесли;

	Иначе
		Сообщить("Штрихкод не найден!");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура _ВернутьсяКТЧ(Команда)
	
	ЗаполнитьПризнакРасхождение();

	Элементы._РедактированиеДокументаНаТСД.Видимость=Истина;
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Ложь;
	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ДобавитьТоварыБезОрдераКПервомуОрдеру()
	Для Каждого Стр Из Объект.Товары Цикл
		Если Не ЗначениеЗаполнено(Стр.Ссылка) Тогда
			Стр.Ссылка = ПервыйОрдер;
			Стр.Распоряжение = ПервыйОрдерРаспоряжение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗавершитьНаСервере(Статус_, ПричинаБлокировки = "")    
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Статус = Статус_;
	
	ДобавитьТоварыБезОрдераКПервомуОрдеру();
	
	Для Каждого Ордер Из СписокОрдеров Цикл
		ОбъектОрдер = Ордер.Значение.ПолучитьОбъект();
		ОбъектОрдер.Статус = Статус;       
		
		ТЗТовары = ВернутьДанныеПоОрдеру(ОбъектОрдер.Ссылка);
		ОбъектОрдер.ВсегоМест = УпаковочныеЛистыСервер.КоличествоМестВТЧ(ТЗТовары);
		ОбъектОрдер.Товары.Загрузить(ТЗТовары);

		Если ЗначениеЗаполнено(НомерВходящегоДокумента) И ОбъектОрдер.НомерВходящегоДокумента <> НомерВходящегоДокумента Тогда
			ОбъектОрдер.НомерВходящегоДокумента = НомерВходящегоДокумента;
		КонецЕсли;

		Если ЗначениеЗаполнено(ДатаВходящегоДокумента) И ОбъектОрдер.ДатаВходящегоДокумента <> ДатаВходящегоДокумента Тогда
			ОбъектОрдер.ДатаВходящегоДокумента = ДатаВходящегоДокумента
		КонецЕсли;     
		
		Попытка     
			ОбъектОрдер.Записать(РежимЗаписиДокумента.Проведение);
			
			Если Не ЗначениеЗаполнено(ТЗТовары) Тогда
				ОбъектОрдер.УстановитьПометкуУдаления(Истина);
				СписокОрдеров.Удалить(Ордер);
			ИначеЕсли ЗначениеЗаполнено(ПричинаБлокировки) Тогда
				Обработки.РабочееМестоКладовщикаАльтерра.ЗаблокироватьВсёНаСервере(ПричинаБлокировки, ОбъектОрдер);
			КонецЕсли;
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ: '" + Ордер.Значение + "'", Ордер.Значение);
		КонецПопытки;
	КонецЦикла;   

КонецПроцедуры 

&НаСервере
Функция ВернутьДанныеПоОрдеру(Ордер)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
		|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВнешняяТаблицаНоменклатуры.КоличествоПлан КАК КоличествоПлан,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
		|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
		|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
		|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
		|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
		|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия,
		|	ВнешняяТаблицаНоменклатуры.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
		|ИЗ
		|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
		|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
		|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
		|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
		|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
		|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
		|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
		|ИЗ
		|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|ГДЕ
		|	ВнешняяТаблицаНоменклатуры.Ссылка = &Ссылка";   
		
	Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ордер);  
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаКлиенте
Процедура ВзятьВРаботу(Команда)		
	ЗавершитьНаСервере(ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ВРаботе"));
	Элементы.ВзятьВРаботу.Видимость = Ложь;
	Элементы.СообщитьОбОшибке.Видимость = Ложь;
	ЗаполнитьНомераДокументов();
КонецПроцедуры

&НаСервере
Функция ПроверкаПоРаспоряжениям()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ                                       
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка,
		|	ПриходныйОрдерНаТовары.Распоряжение КАК Распоряжение
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Ссылка В (&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", СписокОрдеров.ВыгрузитьЗначения());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		Если ТипЗнч(РезультатЗапроса.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") И 
			Не ПроверитьПрикрепленныеФайлыПоПрефиксу("Scan_", РезультатЗапроса.Ссылка) Тогда
			
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура Завершить(Команда)                
	
	Если НомерВходящегоДокумента = "" Тогда
		Сообщить("Заполните номер и дату вх. документа");
		Возврат;
	КонецЕсли;     
	
	Если Не ПроверкаПоРаспоряжениям() Тогда  
		Сообщить("Загрузите скан для вх. документов");
		Возврат;
	КонецЕсли;
	
	ПроверитьНеобходимостьЗапускаБП_Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)     
	ЗавершитьНаСервере(ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ТребуетсяОбработка"));
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)     
	ЗавершитьНаСервере(ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.КПоступлению"));
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура _ИзменитьЯчейку(Команда)
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Ложь;
	Элементы._ВыборЯчейки.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура _ПрисвоитьШК(Команда)
	СоздатьШК(НовыйШтрихкод);
КонецПроцедуры

#Область НеопознанныйТовар

&НаКлиенте
Процедура _НеопознанныйТовар(Команда)
	
	Если ЗначениеЗаполнено(ПервыйОрдер) Тогда
		НеопознанныйТовар = ПолучитьНеопознанныйТовар(ПервыйОрдер);
		Если ЗначениеЗаполнено(НеопознанныйТовар) Тогда	
			Если ТипЗнч(ПервыйОрдерРаспоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Оповещение = Новый ОписаниеОповещения("ДобавитьНеопознанныйТоварЗавершение", ЭтотОбъект); 
				
				ПараметрыФормы = Новый Структура();
				ПараметрыФормы.Вставить("Номенклатура", НеопознанныйТовар);
				ПараметрыФормы.Вставить("ЗаказПоставщику", ПервыйОрдерРаспоряжение); 
				ПараметрыФормы.Вставить("ПриходныйОрдерНаТовары", ПервыйОрдер);

				ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.Док_НеопознаннаяНоменклатура", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе
				ДобавитьНеопознанныйТоварЗавершение(НеопознанныйТовар, Неопределено);
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить неопознанный товар");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНеопознанныйТовар(Ордер)
	Возврат Документы.ПриходныйОрдерНаТовары.ПолучитьНеопознанныйТовар(Ордер.Склад, Ордер.Номер);
КонецФункции

&НаКлиенте
Процедура ДобавитьНеопознанныйТоварЗавершение(НеопознанныйТовар, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(НеопознанныйТовар) Тогда
		НоваяСтрока = Объект.Товары.Добавить();
		ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		НоваяСтрока.Номенклатура = НеопознанныйТовар;
		ВвестиЧисло(Количество, "Введите количество");
		НоваяСтрока.КоличествоУпаковок = Количество;
		НоваяСтрока.Количество = Количество;
		НоваяСтрока.Ссылка = ПервыйОрдер;
		НоваяСтрока.Распоряжение = ПервыйОрдерРаспоряжение;
	КонецЕсли;
КонецПроцедуры

// Запуск БП

&НаКлиенте
Процедура ПроверитьНеобходимостьЗапускаБП_Клиент()
	Если ТипЗнч(ПервыйОрдерРаспоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если ПроверитьНеобходимостьЗапускаБП(ПервыйОрдер) Тогда  
    		ПоказатьВопрос(
				Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект), 
				"В документе присутствует ""Неопознанная номенклатура"", запустить БП в Битриксе?", 
				РежимДиалогаВопрос.ДаНет);
				
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьНеобходимостьЗапускаБП_Клиент_Завершение();
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПроверитьНеобходимостьЗапускаБП(Ордер)
	Возврат Документы.ПриходныйОрдерНаТовары.ПроверитьНеобходимостьЗапускаБП(Ордер);  
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗапуститьБпПоНеопознаннойНоменклатуре(ПервыйОрдер, ПервыйОрдерРаспоряжение, ПервыйОрдерРабочийУчасток);	
	КонецЕсли;
	
	ПроверитьНеобходимостьЗапускаБП_Клиент_Завершение();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьЗапускаБП_Клиент_Завершение()
	ДопМодульКлиент.ОчиститьСтрокиСНулевымКоличеством(Объект.Товары, Истина, КэшированныеЗначения); 
	ЗавершитьНаСервере(ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят")); 
	Закрыть();	
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ЗапуститьБпПоНеопознаннойНоменклатуре(Ссылка, Распоряжение, РабочийУчасток)
	Документы.ПриходныйОрдерНаТовары.ЗапуститьБпПоНеопознаннойНоменклатуре(Ссылка, Распоряжение, РабочийУчасток);  
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Док__СоздатьОграниченноГодныйВместо(Команда)
	Док__СоздатьОграниченноГодныйВместоНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура Док__СоздатьОграниченноГодныйВместоНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Справочники.Номенклатура.СоздатьОграниченноГодныйТовар(Номенклатура);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаблокироватьВсёНаПересортицуПосле(Команда)	
	ЗавершитьНаСервере(ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ВРаботе"), "Брак на складе"); 
КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаблокироватьВсёНаБракОтПокупателейПосле(Команда)	
	ЗавершитьНаСервере(ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.ВРаботе"), "Брак от покупателей");	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоЯчейке(Команда)
	СортироватьСтроки("ТоварыЯчейка", "Возр");
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВесу(Команда)
	
	Действия = Новый Структура();
	Действия.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	Действия.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	Действия.Вставить("ПересчитатьВесОбъем");
	Для каждого Строка Из Объект.Товары Цикл
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Строка, Действия, КэшированныеЗначения);
		Строка.Вес = Строка.КоличествоПлан*Строка.ВесУпаковки;
	КонецЦикла; 

	СортироватьСтроки("ТоварыВес", "УБЫВ");
	Элементы.ТоварыВес.Видимость = Ложь;
	Элементы.ТоварыВесУпаковки.Видимость = Ложь;
	Элементы.ТоварыЯчейка.Видимость = Истина;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура СортироватьСтроки(ИмяКолонки, Направление)
	ИмяКолонкиНаправление = СтрЗаменить(Элементы[ИмяКолонки].ПутьКДанным, "Объект.Товары.","") + " " + Направление; 
	
	Объект.Товары.Сортировать(ИмяКолонкиНаправление);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеИИнициализация

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТЧТовары(Перенумеровать = Истина, КэшированныеЗначения = Неопределено)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьВесОбъем");
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры",
		Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул",
		Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
		
	// Для заполнения признака ШтрихкодНеОпределен получим данные по штрихкодам
	ТЗШтрихкоды = Объект.Товары.Выгрузить(,"Штрихкод");
	ТЗШтрихкоды.Свернуть("Штрихкод");
	МассивШтрихкодов = ТЗШтрихкоды.ВыгрузитьКолонку("Штрихкод");
	
	КешированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(КешированныеЗначения, МассивШтрихкодов);
	
	Если Объект.Товары.НайтиСтроки(Новый Структура("ЭтоУпаковочныйЛист", Истина)).Количество() > 0 Тогда
		Документы.УпаковочныйЛист.ДополнитьДанныеПоШтрихкодам(КешированныеЗначения, МассивШтрихкодов);
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТовМестаТребуетсяОбработка");
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Штрихкод)
			Или ЗначениеЗаполнено(КешированныеЗначения.Штрихкоды[СтрокаТЧ.Штрихкод])
				И КешированныеЗначения.Штрихкоды[СтрокаТЧ.Штрихкод].Количество() > 0 Тогда
			СтрокаТЧ.ШтрихкодНеОпределен = 0;
		Иначе
			СтрокаТЧ.ШтрихкодНеОпределен = 1;
		КонецЕсли;
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПлановоеКоличество()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПриходныйОрдерНаТовары.Распоряжение КАК Распоряжение
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СписокОрдеров.ВыгрузитьЗначения());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", РезультатЗапроса);
	Запрос.УстановитьПараметр("Ордера", СписокОрдеров.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ТекущаяДата()));
	
	ТекстЗапроса =
	    "ВЫБРАТЬ
	    |	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	    |	ТоварыКПоступлению.Характеристика КАК Характеристика,
	    |	ВЫБОР
	    |		КОГДА ЕСТЬNULL(ТоварыКПоступлению.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	    |			ТОГДА ТоварыКПоступлению.Назначение
	    |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	    |	КОНЕЦ КАК Назначение,
	    |	СУММА(ТоварыКПоступлению.Количество) КАК КоличествоПлан,
	    |	ТоварыКПоступлению.Распоряжение КАК Распоряжение
	    |ИЗ
	    |	(ВЫБРАТЬ
	    |		ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	    |		ТоварыКПоступлению.Характеристика КАК Характеристика,
	    |		ТоварыКПоступлению.Назначение КАК Назначение,
	    |		ТоварыКПоступлению.КОформлениюОрдеровОстаток - ТоварыКПоступлению.ПринимаетсяОстаток КАК Количество,
	    |		ТоварыКПоступлению.ДокументПоступления КАК Распоряжение
	    |	ИЗ
	    |		РегистрНакопления.ТоварыКПоступлению.Остатки(&ДатаОстатков, ДокументПоступления В (&Распоряжение)) КАК ТоварыКПоступлению
	    |	
	    |	ОБЪЕДИНИТЬ ВСЕ
	    |	
	    |	ВЫБРАТЬ
	    |		ТоварыКПоступлению.Номенклатура,
	    |		ТоварыКПоступлению.Характеристика,
	    |		ТоварыКПоступлению.Назначение,
	    |		ВЫБОР
	    |			КОГДА ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	    |				ТОГДА -ТоварыКПоступлению.КОформлениюОрдеров
	    |			ИНАЧЕ ТоварыКПоступлению.КОформлениюОрдеров
	    |		КОНЕЦ - ВЫБОР
	    |			КОГДА ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	    |				ТОГДА -ТоварыКПоступлению.Принимается
	    |			ИНАЧЕ ТоварыКПоступлению.Принимается
	    |		КОНЕЦ,
	    |		ТоварыКПоступлению.ДокументПоступления
	    |	ИЗ
	    |		РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	    |	ГДЕ
	    |		ТоварыКПоступлению.Активность
		|		И ТоварыКПоступлению.Регистратор В(&Ордера)
	    |		И ТоварыКПоступлению.ДокументПоступления В(&Распоряжение)) КАК ТоварыКПоступлению
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ТоварыКПоступлению.Номенклатура,
	    |	ТоварыКПоступлению.Характеристика,
	    |	ТоварыКПоступлению.Назначение,
	    |	ВЫБОР
	    |		КОГДА ЕСТЬNULL(ТоварыКПоступлению.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	    |			ТОГДА ТоварыКПоступлению.Назначение
	    |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	    |	КОНЕЦ,
	    |	ТоварыКПоступлению.Распоряжение
	    |
	    |ИМЕЮЩИЕ
	    |	СУММА(ТоварыКПоступлению.Количество) > 0";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	ТоварыПоРаспоряжению.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОжидание() Экспорт
	
	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаСтрокаРедактирования = Элементы._РедактированиеСтрокиНаТСД.Видимость;
	
	Если АктивнаСтрокаРедактирования Тогда
		НомерСтроки = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД).НомерСтроки;
	КонецЕсли;
	
	Если ЗаписатьИзменениеТабличнойЧасти() Тогда
		
		ЗаполнитьПлановоеКоличествоВТаблице();
		ЗаполнитьПризнакРасхождение();
		ЗаполнитьТоварыЯчейка();
		
		Если АктивнаСтрокаРедактирования Тогда
			ТекущаяСтрокаТСД = Объект.Товары[НомерСтроки-1].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьИзменениеТабличнойЧасти() 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДобавитьТоварыБезОрдераКПервомуОрдеру();
	
	ДанныеИзменены = Ложь;
	
	Для Каждого Ордер Из СписокОрдеров Цикл
		ОбъектОрдер = Ордер.Значение.ПолучитьОбъект();
		
		Если ОбъектОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда
			Продолжить;
		КонецЕсли;
		
		ТЗТовары = ВернутьДанныеПоОрдеру(ОбъектОрдер.Ссылка);
		
		Если АльтерраОбщегоНазначения.ТабличнаяЧастьИзменилась(ОбъектОрдер.Товары.Выгрузить(), ТЗТовары) Тогда
			ОбъектОрдер.ВсегоМест = УпаковочныеЛистыСервер.КоличествоМестВТЧ(ТЗТовары);
			ОбъектОрдер.Товары.Загрузить(ТЗТовары);
			
			Если ЗначениеЗаполнено(НомерВходящегоДокумента) И ОбъектОрдер.НомерВходящегоДокумента <> НомерВходящегоДокумента Тогда
				ОбъектОрдер.НомерВходящегоДокумента = НомерВходящегоДокумента;
			КонецЕсли;

			Если ЗначениеЗаполнено(ДатаВходящегоДокумента) И ОбъектОрдер.ДатаВходящегоДокумента <> ДатаВходящегоДокумента Тогда
				ОбъектОрдер.ДатаВходящегоДокумента = ДатаВходящегоДокумента
			КонецЕсли;
		
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектОрдер, Истина);
			
			ДанныеИзменены = Истина;
		КонецЕсли;
	КонецЦикла;   
	
	Возврат ДанныеИзменены;
	
КонецФункции

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура("ПересчитатьКоличествоЕдиниц");
				
	СтруктураДействийСИзмененнымиСтроками = Новый Структура("ПересчитатьКоличествоЕдиниц");
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	СтруктураДействий.НеИспользоватьУпаковки                 = Истина;   
	СтруктураДействий.ШтрихкодыВТЧ                           = Истина;
	СтруктураДействий.ИмяТЧ                                  = "Товары";
	СтруктураДействий.ИмяКолонкиКоличество                   = "КоличествоУпаковок";
	СтруктураДействий.БлокироватьДанныеФормы                 = Истина;
	
	Если АльтерраОбщегоНазначения._РольДоступна("РаботаСТСД") Тогда
		СтруктураДействий.ДействияСНеизвестнымиШтрихкодами = "НетДействий";
	КонецЕсли;
	
	СтароеКоличествоСтрок = Объект.Товары.Количество();
	
	ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения);
	
	Если СтароеКоличествоСтрок <> Объект.Товары.Количество() Тогда
   		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОбработатьШтрихкодыДалее", ЭтотОбъект, СтруктураДействий), 
			"Выбранный товар не найден в ордерах. Добавить его?", 
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработатьШтрихкодыИтог(СтруктураДействий);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодыДалее(Результат, СтруктураДействий) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьШтрихкодыИтог(СтруктураДействий);
	Иначе
		Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
			Объект.Товары.Удалить(Объект.Товары.НайтиПоИдентификатору(СтруктураДействий.ТекущаяСтрока));
		КонецЕсли;
	КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодыИтог(СтруктураДействий)    
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		Элементы.Товары.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
	КонецЕсли;
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		ТекущаяСтрокаТСД = СтруктураДействий.ТекущаяСтрока;
		ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
		
		Если типзнч(ЭлементСписка) <> Тип("Неопределено") Тогда
			Если ЭлементСписка.КоличествоУпаковок = ЭлементСписка.КоличествоПлан Тогда
				
				Элементы._РедактированиеДокументаНаТСД.Видимость=Истина;
				Элементы._РедактированиеСтрокиНаТСД.Видимость=Ложь;
				
				ЗаполнитьПризнакРасхождение();
				
			Иначе
							
				Элементы._РедактированиеДокументаНаТСД.Видимость=Ложь;
				Элементы._РедактированиеСтрокиНаТСД.Видимость=Истина;
				
				НоваяЯчейка = "";
				НовыйШтрихкод = "";
				
				ТекущийОрдер = ЭлементСписка.Ссылка;
			    Распоряжение = ЭлементСписка.Распоряжение;
				Номенклатура = ЭлементСписка.Номенклатура;
				Характеристика = ЭлементСписка.Характеристика;
				Количество = ЭлементСписка.КоличествоУпаковок;
				ЭлементСписка.Количество = ЭлементСписка.КоличествоУпаковок;
				ПоУчету = ЭлементСписка.КоличествоПлан;
				Комментарий = ЭлементСписка.Комментарий;
				ПолучитьЯчейку(Номенклатура, Склад);
				ПолучитьАдресКартинки(Номенклатура);
	        Конецесли;
		Иначе
				Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
				КонецЕсли;
			ОбщегоНазначенияКлиент.СообщитьПользователю("Штрихкод не найден!");
		КонецЕсли;
		
	#КонецЕсли

    ЭтаФорма.ОбновитьОтображениеДанных();	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма,Объект,СтруктураДействий,КэшированныеЗначения);
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		СтруктураДействийСТекущейСтрокой = Новый Структура;
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
		СтруктураДействийСТекущейСтрокой.Вставить("ПересчитатьВесОбъем");
		
		ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(СтруктураДействий.ТекущаяСтрока);

		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействийСТекущейСтрокой, КэшированныеЗначения);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
#КонецОбласти

#Область Прочее

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(Форма, Действия)
	
	Действия.Вставить("ПересчитатьКоличествоЕдиниц");
	
КонецФункции

Процедура ПолучитьЯчейку(НоменклатураСсылка, СкладСсылка)
	Документы.ПриходныйОрдерНаТовары.ПолучитьЯчейку(НоменклатураСсылка, СкладСсылка, Ячейка);
КонецПроцедуры

&НаКлиенте
Процедура ПоФактуПриИзменении(Элемент)
	
	ИзменитьКоличествоВСтрокеПоИдентификатору(ТекущаяСтрокаТСД,Количество,Комментарий);
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрокаТСД);
	
	СтруктураДействий = Новый Структура;
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект,СтруктураДействий);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоВСтрокеПоИдентификатору(Идентификатор,Количество,ТекстКоммент)
	 СтрокаИзменения = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
	 СтрокаИзменения.КоличествоУпаковок = Количество;
	 СтрокаИзменения.Количество = Количество;
	 СтрокаИзменения.Комментарий = ТекстКоммент; 
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	ИзменитьКоличествоВСтрокеПоИдентификатору(ТекущаяСтрокаТСД,Количество,Комментарий);
КонецПроцедуры

Функция ИзменитьЯчейку()
	Возврат Документы.ПриходныйОрдерНаТовары.ИзменитьЯчейку(Номенклатура, Склад, Ячейка, НоваяЯчейка);
КонецФункции

Процедура СоздатьШК(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка,
	|	ШтрихкодыНоменклатуры.Номенклатура.Наименование КАК НоменклатураПредставление,
	|	ШтрихкодыНоменклатуры.Характеристика.Наименование КАК ХарактеристикаПредставление,
	|	ШтрихкодыНоменклатуры.Упаковка.Наименование КАК УпаковкаПредставление
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для номенклатуры %Номенклатура%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Номенклатура%", """" + Выборка.НоменклатураПредставление + """"
		+ ?(ЗначениеЗаполнено(Выборка.Характеристика), " " + НСтр("ru='с характеристикой'") + " """ + Выборка.ХарактеристикаПредставление + """", "")
		+ ?(ЗначениеЗаполнено(Выборка.Упаковка), " " + НСтр("ru='в упаковке'") + " """ + Выборка.УпаковкаПредставление + """", ""));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;
		Сообщение.Сообщить();
		
	Иначе
		МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Штрихкод = Штрихкод;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Характеристика = Характеристика;

		МенеджерЗаписи.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Штрихкод записан!";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЯчейкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Истина;
	Элементы._ВыборЯчейки.Видимость = Ложь;

	НоваяЯчейка = Элементы.ДоступныеЯчейки.ТекущиеДанные.Ссылка;
	Если ИзменитьЯчейку() Тогда
			ПолучитьЯчейку(Номенклатура, Склад);	
			Сообщить("Ячейка изменена!");
	Иначе
			Ячейка = "";
			Сообщить("При измененеии ячейки произошли проблемы! Ячейка не изменена!");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииСервер(КэшированныеЗначения)
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	СтруктураДействийСТекущейСтрокой = Новый Структура;
	СтруктураДействийСТекущейСтрокой.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействийСТекущейСтрокой.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействийСТекущейСтрокой.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействийСТекущейСтрокой.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));
		
	УпаковочныеЛистыСервер.НоменклатураУпаковочныйЛистПриИзменении(ЭтаФорма, Объект.Товары,
		"ТоварыНоменклатура", КэшированныеЗначения, СтруктураДействийСТекущейСтрокой);
		
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКачествоНоменклатуры(Команда)
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Ложь;
	Элементы._ВыборНК.Видимость = Истина;
	
	ИзменитьКачествоСервер();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьКачествоСервер() 		
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПоНоменклатуре, "Номенклатура", Номенклатура, ВидСравненияКомпоновкиДанных.Равно,,Истина);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы._РедактированиеСтрокиНаТСД.Видимость=Истина;
	Элементы._ВыборНК.Видимость = Ложь;

	НоменклатураНК = Элементы.Список.ТекущиеДанные.НоменклатураБрак;
	
	ВвестиЧисло(Количество,"Введите количество");
	НоваяСтрока = Объект.Товары.Добавить();
	ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	НоваяСтрока.Номенклатура = НоменклатураНК; 
	НоваяСтрока.КоличествоУпаковок = Количество;
	НоваяСтрока.Количество = Количество;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатура1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НовыйТовар = Элементы.СписокНоменклатура1.ТекущиеДанные.Ссылка; 
	СтруктураПоиска = Новый Структура("Номенклатура", НовыйТовар);

	МассивСтрок = Объект.Товары.НайтиСтроки(СтруктураПоиска);
	Если ЗначениеЗаполнено(МассивСтрок) Тогда
		ТекущаяСтрокаТСД = МассивСтрок[0].ПолучитьИдентификатор();
		ТоварыВыбор_Обработка(Ложь);
	Иначе		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОповещениеОНовомТоваре", ЭтотОбъект, СтруктураПоиска), 
			"Выбранный товар не найден в ордерах. Добавить его?", 
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОповещениеОНовомТоваре(Результат, СтруктураДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Номенклатура = СтруктураДопПараметры.Номенклатура;
		ТекущийОрдер = ПервыйОрдер;
		Распоряжение = ПервыйОрдерРаспоряжение;
    	ПолучитьЯчейку(Номенклатура, Склад);
	
		Характеристика = "";
		ПоУчету = 0;
		Количество = 0;
		Комментарий = "";
		НоваяЯчейка = "";
		НовыйШтрихкод = "";
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Распоряжение = Распоряжение;
		НоваяСтрока.Ссылка = ТекущийОрдер;
		
		ТекущаяСтрокаТСД = НоваяСтрока.ПолучитьИдентификатор(); 
		
		Элементы._РедактированиеСтрокиНаТСД.Видимость = Истина;
		Элементы._ВыборНоменклатуры.Видимость = Ложь;
	КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановоеКоличествоВТаблице()  
	
	Для каждого Строка из ТоварыПоРаспоряжению Цикл
		МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Назначение,Распоряжение",Строка.Номенклатура,Строка.Характеристика,Строка.Назначение,Строка.Распоряжение));
		Для каждого СтрокаМассив из МассивСтрок Цикл
			СтрокаМассив.КоличествоПлан = Строка.КоличествоПлан;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьХарактеристики(Команда)
	ОтображатьХарактеристики = Не ОтображатьХарактеристики;
    УстановитьВидимостьХарактеристик();	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьХарактеристик()
	Элементы.ТоварыХарактеристика.Видимость =ОтображатьХарактеристики;
	Элементы.Характеристика.Видимость=ОтображатьХарактеристики;
КонецПроцедуры

&НаКлиенте
Процедура ТолькоРасхождения(Команда)
	ТолькоРасхождения = Не ТолькоРасхождения;
	ЗаполнитьПризнакРасхождение();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакРасхождение()
	
	Для Каждого СтрТабл Из Объект.Товары Цикл
		СтрТабл.Расхождение = СтрТабл.КоличествоУпаковок <> СтрТабл.КоличествоПлан;
	КонецЦикла;
	
	Если ТолькоРасхождения Тогда
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Расхождение",Истина);
	Иначе
		Элементы.Товары.ОтборСтрок = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьАдресКартинки(Номенклатура)
	Документы.ПриходныйОрдерНаТовары.ПолучитьАдресКартинки(Номенклатура, ЭтотОбъект.УникальныйИдентификатор, АдресКартинки);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеЗаменаИзображения(Команда)
	Если ЗначениеЗаполнено(Номенклатура) Тогда  
		Замечание = "";
		Если ВвестиСтроку(Замечание, "Текст замечания (что не так)") Тогда
			Если Замечание <> "" Тогда
				ДопМодуль.ОтправитьСообщениеОЗаменеКартинки("Замените изображение у номенклатуры - ", Номенклатура, Замечание, Сотрудник); 
			Иначе
				 ОбщегоНазначенияКлиент.СообщитьПользователю("Для отправки запроса на замену картинки товара необходимо заполнить 'Текст замечания'!");
			КонецЕсли;
		Иначе 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для отправки запроса на замену картинки товара необходимо заполнить 'Текст замечания'!");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
		глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
		глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
		глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыЯчейка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|ГДЕ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура В(&Номенклатура)
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Товары.Выгрузить(,"Номенклатура"));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для каждого Строка Из Объект.Товары Цикл
			Если Строка.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура Тогда
				Строка.Ячейка = ВыборкаДетальныеЗаписи.Ячейка;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

#Область ДобавлениеФото
Функция КнопкиОповещения()
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Отмена");
	Кнопки.Добавить("С телефона");
	Кнопки.Добавить("Камера");
	
	Возврат Кнопки;
	
КонецФункции 

&НаКлиенте
Процедура ВыбратьСпособДобавленияФото(РезультатВопроса, ДополнительныеПараметры) Экспорт
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Если РезультатВопроса = "Камера" Тогда
			Если ДополнительныеПараметры.ИмяКоманды =  "ДобавитьФотоТС" Тогда 
				СделатьФотоКамерой(ДополнительныеПараметры.ИмяКоманды);
			Иначе
				СделатьФотоКамерой(ДополнительныеПараметры.ИмяКоманды);
			КонецЕсли;
		ИначеЕсли 
			РезультатВопроса = "С телефона" Тогда
			ДобавитьФотоИзГалереи(ДополнительныеПараметры.ИмяКоманды);
		Иначе
			Если ДополнительныеПараметры.ИмяКоманды = "ДобавитьФотоТС" Тогда
				ЭтаФорма.Закрыть();
			Иначе
				Возврат;
			КонецЕсли; 
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)        
	
	Если Команда.Имя = "ДобавитьСканДокумента" 
		И Не ЗначениеЗаполнено(НомерВходящегоДокумента) Или Не ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните номер и дату вх. документа");
		Возврат;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКоманды", Команда.Имя);
	
	Кнопки = КнопкиОповещения();
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСпособДобавленияФото", Этаформа, ДополнительныеПараметры), "Загрузите фото.", Кнопки);

КонецПроцедуры

&НаКлиенте
Процедура СделатьФотоКамерой(ИмяКоманды)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
	ДанныеМультимедиа = Неопределено;
	Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда	
		ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок(,, 100,,ТипПодсветкиКамеры.Включена);
	Иначе    
		Сообщить(НСтр("ru = 'Съемка фото не поддерживается.'", "ru"));
	КонецЕсли; 
	

	Если ДанныеМультимедиа <> Неопределено Тогда
		Попытка
			СоздатьНовыйФайл(ДанныеМультимедиа.ПолучитьДвоичныеДанные(), ДанныеМультимедиа.РасширениеФайла, ИмяКоманды);
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды); 
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗавершение", Этаформа, ДополнительныеПараметры), "Изображение успешно загружено." + Символы.ПС + "Добавить новый снимок?", РежимДиалогаВопрос.ДаНет, 0.1);
		Исключение
			Ошибка = ИнформацияОбОшибке();
		    ПодробнаяОшибка = ПодробноеПредставлениеОшибки(Ошибка);
			Сообщить(ПодробнаяОшибка);
		КонецПопытки;
	КонецЕсли;
	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФотоИзГалереи(ИмяКоманды)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Фильтр = "Все картинки (*.jpg;*.jpeg;*.tif;*.png)"
		+ "|*.jpg;*.jpeg;*.tif;*.png|";
		Диалог.МножественныйВыбор = Истина;
		
		Если Диалог.Выбрать() Тогда
			МассивФайлов = Диалог.ВыбранныеФайлы;
			Сч = 0;
			Для каждого Файл Из МассивФайлов Цикл
				Фото = Новый Файл(Файл);
				Данные = Новый ДвоичныеДанные(Фото.ПолноеИмя);
				ПредставлениеФайла = Фото.ПолучитьПредставлениеФайлаБиблиотекиМобильногоУстройства();
				РасширениеФайла = СтрРазделить(ПредставлениеФайла, ".");
				Расширение = РасширениеФайла[РасширениеФайла.Количество()-1];
				Попытка
					СоздатьНовыйФайл(Данные,Расширение,ИмяКоманды);
					Сч = Сч + 1;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
			ПоказатьПредупреждение(, "Загружено " + Сч + " из " + МассивФайлов.Количество() + " файлов", 1);
		КонецЕсли;
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СделатьФотоКамерой(ДополнительныеПараметры.ИмяКоманды);
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовыйФайл(Данные,Расширение,Команда)  
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Ордер Из СписокОрдеров Цикл
		СсылкаОрдер = Ордер.Значение;   
		Если ТипЗнч(СсылкаОрдер.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ИмяПапки =  СтрЗаменить(СтрЗаменить(Строка(СсылкаОрдер), ":", "_"), " ", "_");
			
			Если Не ЗначениеЗаполнено(Справочники.ЗаказПоставщикуПрисоединенныеФайлы.НайтиПоНаименованию(ИмяПапки, Истина)) Тогда
				ГруппаОрдера = Справочники["ЗаказПоставщикуПрисоединенныеФайлы"].СоздатьГруппу();
				ГруппаОрдера.ВладелецФайла = СсылкаОрдер.Распоряжение;
				ГруппаОрдера.Наименование = ИмяПапки;
				ГруппаОрдера.Записать();
			КонецЕсли;
			ИмяПапкиОрдера = Справочники.ЗаказПоставщикуПрисоединенныеФайлы.НайтиПоНаименованию(ИмяПапки, Истина);
			
			Имя = ПолучитьИмяФайла(СсылкаОрдер);
			
			Если Команда = "ДобавитьСканДокумента" Тогда
				ИмяФайла = "Scan_" + Имя;
			КонецЕсли;
			
			Если Команда = "ДобавитьФотоТовара" Тогда
				Наименование = СтрРазделить(Строка(Номенклатура), " ");
				ЭлементМассива = 0;
				НоваяСтрока = "";
				Пока ЭлементМассива < 4 Цикл
					НоваяСтрока = НоваяСтрока + Наименование[ЭлементМассива] + "_";
					ЭлементМассива = ЭлементМассива + 1;
				КонецЦикла;
				ИмяФайла = Имя + "_"
				+ СтрЗаменить(НоваяСтрока, ",", "")
				+ Строка(Формат(ТекущаяДата(),"ДФ=dd.MM.yy"));
			КонецЕсли;
			
			Если Команда = "ДобавитьФотоТС" Тогда
				ИмяФайла  = "ФотоТС_" + Имя;
			КонецЕсли; 
			

			АдресВХранилище = ПоместитьВоВременноеХранилище(Данные);
			ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайла.Автор = ПараметрыСеанса.ТекущийПользователь.Наименование;
			ПараметрыФайла.ВладелецФайлов = СсылкаОрдер.Распоряжение;
			ПараметрыФайла.ГруппаФайлов = ИмяПапкиОрдера; 
			ПараметрыФайла.ИмяБезРасширения = ИмяФайла;
			ПараметрыФайла.РасширениеБезТочки = Расширение;
			РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВХранилище);
			
		КонецЕсли;
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

Функция ПолучитьИмяФайла(СсылкаОрдер) 
	Имя = СтрЗаменить(Строка(СсылкаОрдер.Склад), " ", "_") + "_" 
		+ СтрЗаменить(Строка(СсылкаОрдер.Отправитель), " ", "_") + "_" 
		+ СтрЗаменить(Строка(СсылкаОрдер.ДатаВходящегоДокумента), ":", "_") + "_" 
		+ НомерВходящегоДокумента;
		
	ЗапрещенныеСимволы = "/\[]:;|=?*<>" + Символ(34);
	Для Сч=1 По СтрДлина(Имя) Цикл
		Символ = Сред(Имя, Сч, 1);
		Если СтрНайти(ЗапрещенныеСимволы, Символ) Тогда 
			Имя = СтрЗаменить(Имя,Символ,"");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Имя; 
Конецфункции

Функция ПроверитьПрикрепленныеФайлыПоПрефиксу(Префикс, СсылкаОрдер)
	Если ЗначениеЗаполнено(Справочники.ЗаказПоставщикуПрисоединенныеФайлы.НайтиПоНаименованию(Префикс + ПолучитьИмяФайла(СсылкаОрдер), Истина)) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
#КонецОбласти

#КонецОбласти  
#Область Оповещения 
Функция СекцииСотрудника()
	Возврат Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
КонецФункции


&НаКлиенте
Процедура Оповещения(Команда)
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
				
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Ложь;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди");  
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Истина;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	Если КлиентовВОчереди > 0 Тогда
		ОбработатьОжидание();
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма", Новый Структура("Сотрудник,ИмяКоманды, ОткрытьОчередь",Сотрудник,"Отгрузка", Истина),ЭтотОбъект);  
	Иначе
		Сообщить("Список очереди пуст");
	КонецЕСли;	
КонецПроцедуры  

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
				 |	РабочиеУчастки.Ссылка КАК Ссылка,
				 |	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
				 |ИЗ
				 |	Справочник.РабочиеУчастки КАК РабочиеУчастки
				 |ГДЕ
				 |	РабочиеУчастки.Ссылка В(&Секции)
				 |	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника()); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
		|ИЗ
		|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
		|ГДЕ
		|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
		|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", СекцииСотрудника());
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди();  
КонецПроцедуры   

&НаСервере
Процедура ОбновитьСписокОчереди() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
    РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
       КлиентовВОчереди = 0;
   	КонецЕсли;  
КонецПроцедуры 	

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СчитатьШтрикодКамера(Команда)
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			Сообщить("Сканирование не поддерживается!");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
		
		#Если МобильныйКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Штрихкод); 
		МассивСсылок.Добавить(Неопределено);
		ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(МассивСсылок));		

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибке(Команда)
	ОткрытьФорму(
		"Обработка.РабочееМестоКладовщикаАльтерра.Форма.ФормаПриемПоРейсу_СообщитьОбОшибке", 
		Новый Структура("СписокОрдеров, ТекущийСотрудникТСД", СписокОрдеров.ВыгрузитьЗначения(), Сотрудник), 
		ЭтаФорма,
		,
		,
		, 
		Новый ОписаниеОповещения("СообщитьОбОшибкеЗавершение", ЭтаФорма), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
	
&НаКлиенте 
Процедура СообщитьОбОшибкеЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(Результат) = Тип("Строка") И ЗначениеЗаполнено(Результат) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);
	КонецЕсли;
КонецПроцедуры
